app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Third title"], ["summary", "Third summary"], ["body", "Third body"], ["created_at", 2017-03-15 19:01:31 UTC], ["updated_at", 2017-03-15 19:01:31 UTC]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Third title!!"], ["updated_at", 2017-03-15 19:12:54 UTC], ["id", 3]]